INSERT INTO OR UPDATE
    DIRECTION_OF_SPECIALTY_INT
    (
        N_SPECIALITY,
        N_DIRECTION,
        KEY_DIRECTION,
        NAME_DIRECTION
    )
VALUES
    (1, 1, '1-88 01 01-01', 'Физическая культура (лечебная)'),
    (1, 2, '1-88 01 01-02', 'Физическая культура (дошкольников)'),
    (2, 3, '1-88 01 02-01', 'Оздоровительная и адаптивная физическая культура (оздоровительная)'),
    (2, 4, '1-88 01 02-02', 'Оздоровительная и адаптивная физическая культура (адаптивная)          '),
    (3, 5, '1-88 01 03-01', 'Физическая реабилитация и эрготерапия (физическая реабилитация)'),
    (3, 6, '1-88 01 03-02', 'Физическая реабилитация и эрготерапия (эрготерапия)'),
    (4, 7, '1-88 02 01-01', 'Спортивно-педагогическая деятельность (тренерская работа с указанием вида спорта)'),
    (4, 8, '1-88 02 01-02', 'Спортивно-педагогическая деятельность (менеджмент в спорте)'),
    (4, 9, '1-88 02 01-03', 'Спортивно-педагогическая деятельность (спортивная психология)'),
    (4, 10, '1-88 02 01-04', 'Спортивно-педагогическая деятельность (спортивная режиссура)'),
    (5, 11, '1-89 01 01-01', 'Туризм и гостеприимство'),
    (6, 12, '1-89 02 01-01', 'Спортивно-туристская деятельность (спортивный и рекреационный туризм)'),
    (6, 13, '1-89 02 01-02', 'Спортивно-туристская деятельность (менеджмент в туризме)');

COMMIT WORK;