INSERT INTO OR UPDATE
    SPECIAL_DIRECTION
    (
        N_SPEC_DIR,
        SPEC_DIR,
        SPEC_DIR_FULL,
        CODE_SPEC_DIR,
        N_SPEC
    )
VALUES
    (1, 'Тренерская работа (с указанием вида спорта)', 'Спортивно-педагогическая деятельность (тренерская работа с указанием вида спорта)', '1-88 02 01-01', 6) MATCHING (N_SPEC_DIR),
    (2, 'Спортивная психология', 'Спортивно-педагогическая деятельность (спортивная психология)', '1-88 02 01-03', 6) MATCHING (N_SPEC_DIR),
    (3, 'Спортивная режиссура', 'Спортивно-педагогическая деятельность (спортивная режиссура)', '1-88 02 01-04', 6) MATCHING (N_SPEC_DIR),
    (4, 'Менеджмент в спорте', 'Спортивно-педагогическая деятельность (менеджмент в спорте)', '1-88 02 01-02', 6) MATCHING (N_SPEC_DIR),
    (5, 'Спортивный и рекреационный туризм', 'Спортивно-туристская деятельность (спортивный и рекреационный туризм)', '1-89 02 01-01', 7) MATCHING (N_SPEC_DIR),
    (6, 'Менеджмент в туризме', 'Спортивно-туристская деятельность (менеджмент в туризме)', '1-89 02 01-02', 7) MATCHING (N_SPEC_DIR),
    (7, 'Лечебная физическая культура', 'Физическая культура (лечебная)', '1-88 01 01-01', 8) MATCHING (N_SPEC_DIR),
    (8, 'Физическая культура дошкольников', 'Физическая культура (дошкольников)', '1-88 01 01-02', 8) MATCHING (N_SPEC_DIR),
    (9, 'Оздоровительная физическая культура', 'Оздоровительная и адаптивная физическая культура (оздоровительная)', '1-88 01 02-01', 5) MATCHING (N_SPEC_DIR),
    (10, 'Адаптивная физическая культура', 'Оздоровительная и адаптивная физическая культура (адаптивная)', '1-88 01 02-02', 5) MATCHING (N_SPEC_DIR),
    (11, 'Физическая реабилитация', 'Физическая реабилитация и эрготерапия (физическая реабилитация)', '1-88 01 03-01', 9) MATCHING (N_SPEC_DIR),
    (12, 'Эрготерапия', 'Физическая реабилитация и эрготерапия (эрготерапия)', '1-88 01 03-02', 9) MATCHING (N_SPEC_DIR),
    (13, 'Туризм и гостеприимство', 'Туризм и гостеприимство', '1-89 01 01', 10) MATCHING (N_SPEC_DIR),
    (14, 'Технологии формирования и продвижения туристических услуг', 'Технологии формирования и продвижения туристических услуг', '1-89 01 01 01', 10) MATCHING (N_SPEC_DIR),
    (15, 'Информационные технологии туристической индустрии', 'Информационные технологии туристической индустрии', '1-89 01 01 02', 10) MATCHING (N_SPEC_DIR),
    (16, 'Логистика в туристической индустрии', 'Логистика в туристической индустрии', '1-89 01 01 03', 10) MATCHING (N_SPEC_DIR),
    (17, 'Технологии социокультурного сервиа туристов', 'Технологии социокультурного сервиа туристов', '1-89 01 01 04', 10) MATCHING (N_SPEC_DIR),
    (18, 'Технологии транспортного сервиса туристов', 'Технологии транспортного сервиса туристов', '1-89 01 01 05', 10) MATCHING (N_SPEC_DIR),
    (19, 'Технологии сервиса питания туристов', 'Технологии сервиса питания туристов', '1-89 01 01 06', 10) MATCHING (N_SPEC_DIR),
    (20, 'Технологии сервиса размещения туристов', 'Технологии сервиса размещения туристов', '1-89 01 01 07', 10) MATCHING (N_SPEC_DIR),
    (21, 'Технологии экскурсионно-сопроводительного сервиса туристов', 'Технологии экскурсионно-сопроводительного сервиса туристов', '1-89 01 01 08', 10) MATCHING (N_SPEC_DIR),
    (22, 'Технологии сервиса оздоровления и лечения туристов', 'Технологии сервиса оздоровления и лечения туристов', '1-89 01 01 09', 10) MATCHING (N_SPEC_DIR),
    (23, 'теория и методика физического воспитания, спортивной тренировки, оздоровительной и адаптивной физической культуры.', 'теория и методика физического воспитания, спортивной тренировки, оздоровительной и адаптивной физической культуры.', '13.00.04', 11) MATCHING (N_SPEC_DIR),
    (24, 'физиология', 'физиология', '03.03.01', 12) MATCHING (N_SPEC_DIR),
    (25, 'теория и методика физического воспитания, спортивной тренировки, оздоровительной и адаптивной физической культуры.', 'теория и методика физического воспитания, спортивной тренировки, оздоровительной и адаптивной физической культуры.', '1-08 80 04', 13) MATCHING (N_SPEC_DIR),
    (26, 'инновационный менеджмент в сфере туризма', 'инновационный менеджмент в сфере туризма', '1-89 81 02', 14) MATCHING (N_SPEC_DIR),
    (27, 'инновационный менеджмент в сфере гостеприимства', 'инновационный менеджмент в сфере гостеприимства', '1-89 81 03', 15) MATCHING (N_SPEC_DIR),
    (28, 'инновационные технологии в сфере туризма и гостеприимства', 'инновационные технологии в сфере туризма и гостеприимства', '1-89 81 04', 16) MATCHING (N_SPEC_DIR),
    (29, 'управление инновационными проектами в туристской индустрии', 'управление инновационными проектами в туристской индустрии', '1-89 81 01', 17) MATCHING (N_SPEC_DIR),
    (31, 'Физическая культура и спорт', 'Физическая культура и спорт', '1-08 80 04', 18) MATCHING (N_SPEC_DIR),
    (32, 'Туризм и гостеприимство', 'Туризм и гостеприимство', '1-89 80 01', 19) MATCHING (N_SPEC_DIR);

COMMIT WORK;