INSERT INTO OR UPDATE
    SPECIALITY_INT
    (
        N_SPECIALITY,
        KEY_SPECIALITY,
        NAME_SPECIALITY
    )
VALUES  
    (1, '1-88 01 01', 'Физическая культура'),
    (2, '1-88 01 02', 'Оздоровительная и адаптивная физическая культура '),
    (3, '1-88 01 03', 'Физическая реабилитация и эрготерапия'),
    (4, '1-88 02 01', 'Спортивно-педагогическая деятельность'),
    (5, '1-89 01 01', 'Туризм и гостеприимство   '),
    (6, '1-89 02 01', 'Спортивно-туристская деятельность ');

COMMIT WORK;