INSERT INTO OR UPDATE
    TYPE_LOCALITY
    (
        N_TYPE,
        COD_CATEGORY,
        NAME_TYPE,
        SHORT_TYPE_NAME
    )
VALUES
    (1, 111, 'город', 'г.'),
    (1, 112, 'город', 'г.'),
    (1, 113, 'город', 'г.'),
    (1, 213, 'город', 'г.'),
    (2, 231, 'деревня', 'д.'),
    (3, 121, 'поселок городского типа', 'пгт.'),
    (3, 221, 'поселок городского типа', 'пгт.'),
    (4, 232, 'поселок сельского типа', 'пст.'),
    (5, NULL, 'железнодорожная станция', 'ж/д ст.'),
    (6, 222, 'курортный поселок', 'кп.'),
    (7, NULL, 'сельский населенный пункт', 'снп.'),
    (8, NULL, 'заводской поселок', 'зп.'),
    (9, 123, 'рабочий поселок', 'р.п.'),
    (9, 223, 'рабочий поселок', 'р.п.'),
    (10, NULL, 'село', 'с.'),
    (21, 234, 'хутор', 'х.'),
    (28, 235, 'агрогородок', 'аг.');

COMMIT WORK;