INSERT INTO
	FACULTY
	(
		N_FAC,
		FAC,
		FAC1,
		KOD_FAC,
		DEAN,
		FAC_RP
	)
	VALUES
		(1, 'Спортивно-педагогический факультет спортивных игр и единоборств', 'СПФ СИиЕ', 1, 'Е. В. Планида', 'спортивно-педагогического факультета спортивных игр и единоборств'),
		(2, 'Спортивно-педагогический факультет массовых видов спорта', 'СПФ МВС', 2, 'И. И. Гуслистова', 'спортивно-педагогического факультета массовых видов спорта'),
		(3, 'Факультет оздоровительной физической культуры', 'ОФК', 0, 'Н. М. Машарская', 'факультета оздоровительной физической культуры'),
		(4, 'Факультет менеджмента спорта, туризма и гостеприимства ', 'МСТиГ', 4, 'О. Н. Михайлова', 'факультета менеджмента спорта, туризма и гостеприимства');

COMMIT WORK;
