INSERT INTO
	PRIVELEG_DETAILS
	(
		ID_DET,
		NAME_DETAIS,
		SHORT_NAME
	)
	VALUES
		(1, 'Олимпийских', 'Олимп.'),
		(2, 'Паралимпийских', 'Парал.'),
		(3, 'Дефлимпийских', 'Дефлимп'),
		(4, '1-е место', '1м.'),
		(5, '2-е место', '2м.'),
		(6, '3-е место', '3м.'),
		(7, '2020', '2020'),
		(8, '2021', '2021'),
		(9, 'финал кубка РБ', 'Фин.КРБ'),
		(10, 'первенство РБ', 'ПРБ'),
		(11, 'Олимпийские дни молодежи РБ', 'ОДМ'),
		(12, 'да', 'да'),
		(0, '', NULL),
		(13, 'Спорт.-пед. направленность', 'Сп-пед'),
		(14, 'Педагог. направленность', 'Педагог');

COMMIT WORK;
