INSERT INTO
	SPECIALITY
	(
		N_SPEC,
		SPEC,
		OLD_NUM,
		CODE_SPEC
	)
	VALUES
		(1, 'Физическая культура и спорт', 1, 'П 02.02.00'),
		(6, 'Спортивно-педагогическая деятельность (по направлениям)', 0, '1-88 02 01'),
		(5, 'Оздоровительная и адаптивная физическая культура (по направлениям)', 0, '1-88 01 02'),
		(7, 'Спортивно-туристская деятельность (по направлениям)', 0, '1-89 02 01'),
		(8, 'Физическая культура (по направлениям)', 0, '1-88 01 01'),
		(9, 'Физическая реабилитация и эрготерапия (по направлениям)', 0, '1-88 01 03'),
		(10, 'Туризм и гостеприимство', 0, '1-89 01 01');

COMMIT WORK;
